const mapping = {
  "tuxing.1": { //0
    pic: "tuxing",
    text: "土星大气以氢、氦为主，它有一个显著的行星环，主要的成分是冰的微粒和较少数的岩石残骸以及尘土（天气这么热，如果人类能在冰的世界里冬眠，那该多好~）。"
  },
  "tuxing2": { //1
    pic: "tuxing",
    text: "土星有一个显著的行星环，其主要成分是冰的微粒和较少数的岩石残骸以及尘土。（这么热，如果人类能在冰的世界里冬眠，那该多好~）"
  },
  "qiu2.1": { //2
    pic: "haiwang",
    text: "表面有荧荧的淡蓝色光，有着太阳系最强烈的风暴，风速高达2100km/h。云顶的温度是-218 ℃（55K），是太阳系最冷的地区之一（这里没人，就是风大）。"
    ,dialog: ["终于找到我","还好我没放弃~","你说啥，这里风大，我听不清","恭喜你找到我啦~"]
  },
  "daxiongxian.15": { //3
    pic: "bigbear",
    text: "北斗七星所在星座，它无疑是北方天空中最醒目、最重要的星座。把大熊星座中的七颗亮星看做一个勺子的形状，这就是我们常说的北斗七星。",
    dialog: ["看我的勺子亮不亮？", "所谓缘分，是我有锅你有勺", "所谓忧伤，是我的勺够不着你的锅！"]
  },
  "shinv.2": { //4
    pic: "waitress",
    text: "又称处女座，是最大的黄道带星座，在全天88个星座中，面积排行第二位，仅次于长蛇座。它是丰收女神的象征，左手拿着麦穗，右手拿着镰刀。"
    ,dialog: ["你怎么这么慢才找到我","你是纠结星人吗？","你们对我的误解太深啦，我是小仙女！","你们这儿的人都是完美主义吧","你说话为何不加问号？","······"]
  },
  "heijianbian.1": { //5
    pic: "halei",
    text: "哈雷彗星是唯一能用裸眼直接从地球看见的短周期彗星，也是人一生中唯一以裸眼可能看见两次的彗星（下次回归时间2061年7月28日，44年后我们再相见！）。"
  },
  "nanshizi.1": { //6
    pic: "shizi",
    text: "88个星座中最小的一个，星座虽小，但亮星很多。郑和下西洋时，曾用这个星座来导航。新西兰、澳大利亚、巴布亚新几内亚和萨摩亚的国旗上都有南十字座。"
  },
  "huo": { //7
    pic: "mars",
    text: "火星最像地球，CO₂为主的大气稀薄又寒冷。它是一颗“沙漠行星”，每年常有尘暴发生（如果未来人类对外星球殖民，它很可能是我们的首选地点）。"
  },
  "shizi.1": { //8
    pic: "lion",
    text: "传说海格列斯是天神宙斯的私生子，出生时遭天后赫拉诅咒，一生要面临十二项考验。第一项就是与刀枪不入、力大无比的狮子搏斗。几经厮杀，海格列斯将狮子杀死。宙斯就把狮子升上天空，炫耀儿子的战绩。"
  },
  "kai": { //9
    pic: "kaipule",
    text: "2015年发现的迄今为止最像地球的宜居行星，有可能拥有大气层和流动水，被称为地球2.0，“地球的表哥”（不过，到底有没有人类还不得而知）。",
    dialog: ["Hey，brother！", "Hey young man！", "你就是地球失散多年的大兄弟？", "Yep~（机智的popo表情）"]
  },
  "xinxin.1": { //10
    pic: "mingwang",
    text: "这是一颗“有爱”的星球，它有一个由氮冰构成的巨大心形区域——汤博区。冥王星是体积最大的海外天体，因被定义为矮行星，所以从太阳系九大行星中除名。"
    ,dialog: ["找到我，向你笔芯哦~","把你的心我的心串一串"]
  },
  "_163": { //11
    pic: "",
    text: ""
  }
};

const nameArray = ["tuxing.1", "tuxing2", "qiu2.1", "daxiongxian.15", "shinv.2",
  "heijianbian.1", "nanshizi.1", "huo", "shizi.1", "kai", "xinxin.1", "_163"];



module.exports = { mapping, nameArray };










